Repository: tbatirov/new_agreement
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: de, es, fr, zh

source: Legal Agreement Generator
de: Generator für Rechtsvereinbarungen
es: Generador de Acuerdos Legales
fr: Générateur de Contrats Juridiques
zh: 法律协议生成器

source: Create Agreement
de: Vereinbarung erstellen
es: Crear Acuerdo
fr: Créer un Contrat
zh: 创建协议

source: Template not found
de: Vorlage nicht gefunden
es: Plantilla no encontrada
fr: Modèle non trouvé
zh: 未找到模板

source: No content provided
de: Kein Inhalt bereitgestellt
es: No se proporcionó contenido
fr: Aucun contenu fourni
zh: 未提供内容

source: Could not analyze text
de: Text konnte nicht analysiert werden
es: No se pudo analizar el texto
fr: Impossible d'analyser le texte
zh: 无法分析文本

source: Could not generate suggestion
de: Vorschlag konnte nicht generiert werden
es: No se pudo generar la sugerencia
fr: Impossible de générer une suggestion
zh: 无法生成建议

source: Non-Disclosure Agreement (NDA)
de: Geheimhaltungsvereinbarung (NDA)
es: Acuerdo de Confidencialidad (NDA)
fr: Accord de Confidentialité (NDA)
zh: 保密协议 (NDA)

source: Service Agreement
de: Dienstleistungsvereinbarung
es: Contrato de Servicios
fr: Contrat de Service
zh: 服务协议

source: Rental Agreement
de: Mietvertrag
es: Contrato de Alquiler
fr: Contrat de Location
zh: 租赁协议

source: Purchase Agreement
de: Kaufvertrag
es: Contrato de Compra
fr: Contrat d'Achat
zh: 购买协议

source: Start Voice Input
de: Spracheingabe starten
es: Iniciar Entrada de Voz
fr: Démarrer l'Entrée Vocale
zh: 开始语音输入

source: Stop Voice Input
de: Spracheingabe stoppen
es: Detener Entrada de Voz
fr: Arrêter l'Entrée Vocale
zh: 停止语音输入

source: Welcome to Legal Agreement Generator
de: Willkommen beim Generator für Rechtsvereinbarungen
es: Bienvenido al Generador de Acuerdos Legales
fr: Bienvenue sur le Générateur de Contrats Juridiques
zh: 欢迎使用法律协议生成器

source: Create and sign legal agreements quickly using voice or text input
de: Erstellen und unterschreiben Sie Rechtsvereinbarungen schnell mit Sprach- oder Texteingabe
es: Crea y firma acuerdos legales rápidamente usando voz o texto
fr: Créez et signez rapidement des contrats juridiques en utilisant la voix ou le texte
zh: 使用语音或文本输入快速创建和签署法律协议

source: Choose a template...
de: Wählen Sie eine Vorlage...
es: Elija una plantilla...
fr: Choisissez un modèle...
zh: 选择模板...

source: Load Template
de: Vorlage laden
es: Cargar Plantilla
fr: Charger le Modèle
zh: 加载模板

source: Agreement Content
de: Vereinbarungsinhalt
es: Contenido del Acuerdo
fr: Contenu du Contrat
zh: 协议内容

source: Real-time Analysis
de: Echtzeit-Analyse
es: Análisis en Tiempo Real
fr: Analyse en Temps Réel
zh: 实时分析

source: Industry Context
de: Branchenkontext
es: Contexto de la Industria
fr: Contexte Industriel
zh: 行业背景

source: Key Terms
de: Schlüsselbegriffe
es: Términos Clave
fr: Termes Clés
zh: 关键条款

source: Risk Assessment
de: Risikobewertung
es: Evaluación de Riesgos
fr: Évaluation des Risques
zh: 风险评估

source: Compliance & Jurisdiction
de: Compliance & Gerichtsbarkeit
es: Cumplimiento y Jurisdicción
fr: Conformité & Juridiction
zh: 合规性与管辖权

source: Improvement Suggestions
de: Verbesserungsvorschläge
es: Sugerencias de Mejora
fr: Suggestions d'Amélioration
zh: 改进建议
